---
kind: type
id: T:Autodesk.Revit.Exceptions.CentralModelAlreadyExistsException
source: html/2ffb2cbc-6ab4-c486-b683-96483f33df78.htm
---
# Autodesk.Revit.Exceptions.CentralModelAlreadyExistsException

Exception is thrown when the central model already exists at the specified location.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class CentralModelAlreadyExistsException : CentralModelException
```